// 판매자 인증 및 가입 페이지 약관 3
import TermsModal from "./TermsModal";

export default function Terms5Modal({
  isOpen,
  onClose,
}: {
  isOpen: boolean;
  onClose: () => void;
}) {
  const TERMS_CONTENT = `
전자금융거래  이용약관 동의



제1조(목적)

이 약관은 같이시켜(이하 '회사'라 한다)와 이용자 사이의 전자금융거래에 관한 기본적인 사항을 정함으로써, 거래의 신속하고 효율적인 처리를 도모하고 거래당사자 상호간의 이해관계를 합리적으로 조정하는 것을 목적으로 합니다.
 

제2조(용어의 정의)

이 약관에서 사용하는 용어의 의미는 다음 각 호와 같습니다.
      가. “전자금융거래”라 함은 회사가 전자적 장치를 통하여 제공하는 금융상품 및 서비스를 이용자가 전자적 장치를 통하여 비대면·자동화된 방식으로 직접 이용하는       거래를 말합니다.
      나. “이용자”라 함은 전자금융거래를 위하여 회사와 체결한 계약(이하 "전자금융거래계약"이라 합니다)에 따라 전자금융거래를 이용하는 고객을 말합니다.
      다. “지급인”이라 함은 전자금융거래에 의하여 자금이 출금되는 계좌(이하 “출금계좌”라 합니다)의 명의인을 말합니다.
      라. “수취인”이라 함은 전자금융거래에 의하여 자금이 입금되는 계좌(이하 “입금계좌”라 합니다)의 명의인을 말합니다.
      마. “전자적 장치”라 함은 현금자동지급기, 자동입출금기, 지급용단말기, 컴퓨터, 전화기 그 밖에 전자적 방법으로 전자금융거래정보를 전송하거나 처리하는데       이용되는 장치를 말합니다.
      바. “접근매체”라 함은 전자금융거래에 있어서 거래지시를 하거나 이용자 및 거래내용의 진정성을 확보하기 위하여 사용되는 다음 각목의 어느 하나에 해당하는 수단       또는 정보를 말합니다.
 회사가 제공한 전자식 카드 및 이에 준하는 전자적 정보
「전자서명법」에 따른 전자서명생성정보 또는 인증서
회사에 등록된 이용자 번호
등록되어 있는 이용자의 생체정보
가목 또는 나목의 수단이나 정보를 사용하는 데 필요한 비밀번호
      사. “전자문서”라 함은 「전자문서 및 전자거래기본법」 제2조 제1호의 규정에 따라 작성·변환되거나 송신·수신 또는 저장된 정보를 말합니다.
      아. “거래지시”라 함은 이용자가 전자금융거래계약에 의하여 회사에 개별적인 전자금융거래의 처리를 지시하는 것을 말합니다.
      자. “오류”라 함은 이용자의 고의 또는 과실 없이 전자금융거래가 약관(개별약관을 포함합니다), 전자금융거래계약 또는 이용자가 거래지시한 대로 이행되지 아니한       경우를 말합니다.
      차. “계좌송금”이라 함은 이용자가 자동입출금기를 통하여 자기 또는 타인의 계좌에 자금을 입금하는 것을 말합니다.
      카. “계좌이체”라 함은 지급인의 전자적 장치를 통한 지급지시에 따라 회사가 지급인의 출금계좌에서 자금을 출금하여 같은 은행 또는 다른 은행의 계좌에 입금하는       것을 말합니다.
      타. “예약에 의한 계좌이체”라 함은 계좌이체가 장래의 특정일자에 이루어지도록 이용자가 미리 거래지시하고 회사가 이를 해당일자에 처리하는 것을 말합니다.
      파. “추심이체”라 함은 수취인의 전자적 장치를 통한 추심지시에 따라 회사가 지급인의 출금계좌에서 자금을 출금하여 같은 은행 또는 다른 은행의 계좌에 입금하는       것을 말합니다.
      하. “예약에 의한 추심이체”라 함은 추심이체가 장래의 특정일자에 이루어지도록 이용자가 미리 거래지시하고 회사가 이를 해당일자에 처리하는 것을 말합니다.
      가. “지연이체”라 함은 이용자가 계좌이체 거래지시를 한 시점으로부터 일정시간이 경과한 후에 회사가 이를 처리하는 것을 말합니다.
      나. “영업일”이라 함은 통상 회사가 영업점에서 정상적인 영업을 하는 날을 말합니다.
      다. “단말기 지정 및 이용”이라 함은 이용자가 전자금융거래 시 계좌이체가 가능한 전자적 장치(이하 “단말기”라 합니다)의 IP주소, MAC주소 등 기기정보를 회사에       등록하고 이용하는 것을 말합니다.
      라. “추가적인 보안조치”라 함은 이용자가 지정하지 않은 단말기를 이용하여 전자금융거래를 하는 경우 제6호의 접근매체 외의 휴대폰 문자 또는 2채널(서로 다른 두       가지 이상의 통신 경로를 이용) 등의 수단으로 본인임을 확인하는 방법을 말합니다.
      마. “전자서명”이라 함은 「전자서명법」 제2조 제2호의 규정에 따른 전자서명을 말합니다.
이 약관에서 별도로 정하지 아니한 용어는 「전자금융거래법」 및 관계 법령 등에서 정하는 바에 따릅니다.
 

제3조(적용되는 거래)

이 약관은 회사와 이용자 사이에 다음 각 호의 전자적 장치를 이용하여 이루어지는 계좌이체(예약에 의한 계좌이체 및 지연이체를 포함합니다. 이하 같습니다), 추심이체(예약에 의한 추심이체를 포함합니다), 계좌송금과 관련한 조회, 입금, 출금 등의 전자금융거래에 적용됩니다.
현금자동지급기, 자동입출금기, 지급용단말기에 의한 거래
컴퓨터에 의한 거래
전화기에 의한 거래
전자적 장치에 의한 거래
 

제4조(전자금융거래계약의 체결 및 해지)

이용자가 전자금융거래를 하고자 하는 경우에는 사전에 회사와 별도의 전자금융거래계약을 체결하여야 합니다. 다만, 다음 각 호의 1에 해당하는 경우에는 그러하지 아니합니다.
      가. 예금잔액, 예금입출금내역 등 단순조회
      나. 현금자동지급기, 자동입출금기, 지급용단말기에 의한 거래 다. 기타 회사가 정하는 거래
전자금융거래 계약을 해지하고자 하는 경우에는 이용자 본인이 전자금융거래에 관한 개별약관에 정한 바에 따라 서면 또는 해당 전자적 장치에 의하여 회사에 해지신청을 하여야 합니다.
 

제5조(접근매체의 발급 및 등록)

회사가 접근매체를 발급할 때에는 이용자의 신청이 있는 경우에 한하여 본인임을 확인한 후에 발급합니다.
제1항의 규정에도 불구하고 회사는 접근매체의 갱신 또는 대체발급 등을 위하여 이용자의 동의를 얻은 경우로서 다음 각 호에 해당하는 경우에는 이용자의 신청이나 본인확인 없는 때에도 발급할 수 있습니다
      가. 갱신 또는 대체발급 예정일전 6개월 이내에 사용된 적이 없는 접근매체에 대하여 이용자로부터 갱신 또는 대체발급에 대한 서면(서명자의 실지명의를 확인할 수       있는 것을 말하며, 전자서명이 있는 전자문서를 포함합니다) 동의를 얻은 경우
      나. 갱신 또는 대체발급 예정일전 6개월 이내에 사용된 적이 있는 접근매체의 경우에는 그 예정일부터 1개월 이전에 이용자에게 발급 예정사실을 알린 후 20일       이내에 이용자로부터 이의제기가 없는 경우
이용자는 전자금융거래계약을 체결하고 거래비밀번호 등을 전자적 장치를 통하여 직접 등록할 경우에는 계약일 포함 3영업일 이내에 등록하여야 합니다.
 

제6조(접근매체의 관리)

이용자는 전자금융거래에 필요한 접근매체에 대하여 다른 법률에 특별한 규정이 없는 한 다음 각 호의 행위를 하여서는 안되며, 접근매체의 도용, 위조, 변조를 방지하기 위한 관리에 충분한 주의를 기울여야 합니다.
접근매체를 제3자에게 대여하거나 사용을 위임하는 행위
접근매체를 제3자에게 양도 또는 담보 목적으로 제공하는 행위
제3자가 권한 없이 이용자의 접근매체를 이용하여 전자금융거래를 할 수 있음을 알았거나 쉽게 알 수 있었음에도 불구하고 접근매체를 누설, 노출, 방치하는 행위
 

제7조(인증방법의 사용)

이용자는 이 약관의 적용대상인 전자금융거래를 이용하는 경우 반드시 회사가 전자금융거래의 종류, 성격, 위험수준 등을 고려하여 정한 인증방법을 사용하여야 합니다.
 

제8조(이용시간)

이용자는 회사가 정한 시간 이내에서 전자금융거래를 이용할 수 있습니다.
이용시간은 회사의 사정에 따라 달라질 수 있으며,회사가 이용시간을 변경하고자 하는 경우에는 그 내용을 이용자가 접근하기 용이한 전자적 장치 및 영업점을 통하여 변경 1개월 전부터 1개월간 알립니다. 다만, 시스템 장애복구, 긴급한 프로그램 보수, 외부요인 등 불가피한 경우에는 예외로 합니다.
 

제9조(수수료)

1.회사는 전자금융 수수료를 이용자의 계좌에서 출금하거나 이용자로부터 직접 현금으로 받을 수 있으며, 수납방법은 개별약관에 따릅니다.
2.회사는 수수료(율)를 고객이 확인할 수 있도록 영업점 및 이용자가 접근하기 용이한 전자적 장치를 통하여 게시하고, 수수료(율)를 변경하는 경우에는 제29조를 준용합니다.
 

제10조(이체 한도)

이용자는 회사가 정한 지정방법에 따라 계좌이체, 추심이체, 계좌송금에 대한 이체 최고한도를 설정하여야 합니다.
 

제11조(거래의 성립)

이용자가 전자금융거래를 하고자 하는 경우에는 다음 각 호의 시기에 거래가 성립합니다.
계좌이체 및 추심이체의 경우에는 이용자가 입력한 거래지시의 내용을 회사가 확인하고 출금자금(수수료를 포함합니다)을 출금계좌원장에 출금기록 한 때
현금출금의 경우에는 이용자가 입력한 거래지시의 내용을 회사가 확인하고 출금자금을 출금계좌원장에 출금기록 한 때
계좌송금의 경우에는 회사가 이용자가 입력한 거래지시의 내용 및 입금자금을 확인한 때
예약에 의한 계좌이체, 예약에 의한 추심이체, 지연이체의 경우는 회사가 이용자의 거래지시 내용을 확인한 때. 다만, 이체시점에 자금이 출금계좌에 입금되어 있을 것을 조건으로 합니다.
 

제12조(거래지시의 처리기준)

회사는 이용자의 거래지시에 포함된 계좌번호, 비밀번호, 이용자번호 등의 접근매체 정보 또는 단말기 정보를 신고된 것과 대조하여 그 일치 여부를 확인한 후에 거래지시를 처리합니다.
이용자의 거래지시와 관련하여 회사가 수신한 전자문서는 각 문서마다 독립된 것으로 봅니다.
제2항의 규정에도 불구하고 거래지시 전자문서가 회사가 정한 시간 내에 동일한 내용으로 반복 수신된 경우 회사는 전화, 기타 이용자에게 즉시 통지할 수 있는 전자적 장치 등을 통하여 이용자의 진정한 거래지시 의사를 확인하는 절차를 거친 후 나머지 전자문서를 폐기할 수 있습니다.
회사는 이용자의 거래지시에 따라 출금계좌에서 자금을 인출할 때 예금거래기본약관에 불구하고 통장이나 지급청구서 또는 수표 없이 인출합니다.
대량계좌이체, 다른 계좌로의 이체 등과 같이 거래의 특성상 수취인의 명의를 확인할 수 없는 경우에는 수취인의 계좌번호를 기준으로 하여 거래지시를 처리합니다.
다른 계로의 이체는 당일 중에 처리합니다. 다만, 당일 중 처리가 불가능한 경우에는 제19조 제4항에서 정한 바에 따라 처리합니다.
예약에 의한 계좌이체, 예약에 의한 추심이체, 지연이체의 경우 이체시점에 출금계좌의 자금이 이용자가 거래지시한 금액 이상일 때 처리합니다.
예약에 의한 계좌이체 및 예약에 의한 추심이체의 경우 이체지정일이 회사의 휴무일로 정해질 때에는 다음 영업일에 거래지시를 처리합니다.
 

제13조(추심이체의 출금 동의)

회사는 추심이체를 실행하기 위하여 다음 각 호에서 정하는 방식에 따라 미리 지급인으로부터 출금에 대한 동의를 얻어야 합니다.
      가. 회사가 지급인으로부터 서면(회사가 정한 전자서명이 있는 전자문서를 포함합니다)에 의하여 출금신청을 받는 방법
      나. 수취인이 지급인으로부터 서면에 의한 출금의 동의를 받아 회사에게 전달(전자적인 방법에 의하여 출금동의의 내역을 전송하는 경우를 포함합니다)하는 방법
지급인은 수취인의 거래지시에 따라 지급인의 계좌의 원장에 출금기록이 끝나기 전까지 회사에 출금동의의 철회를 요청할 수 있습니다.
제2항의 규정에도 불구하고 대량으로 처리하는 거래 또는 예약에 의한 추심이체거래의 경우에는 지급인은 출금일 전영업일까지 회사 영업점에 서면으로 출금 동의의 철회를 요청할 수 있습니다.
 

제14조(지급의 효력발생시기)

계좌이체, 추심이체 및 계좌송금의 경우에는 수취인의 계좌원장에 입금기록을 마친 때에 지급의 효력이 생깁니다.
현금출금의 경우에는 이용자가 현금을 수령한 때에 지급의 효력이 생깁니다.
선불전자지급수단 및 전자화폐로 지급하는 경우에는 거래지시된 금액의 정보가 수취인이 지정한 전자적 장치에 도달한 때에 지급의 효력이 생깁니다.
그 밖의 전자지급수단으로 지급하는 경우에는 거래지시된 금액의 정보가 수취인의 계좌가 개설되어 있는 회사 등의 전자적 장치에 입력이 끝난 때에 지급의 효력이 생깁니다.
 

제15조(거래지시의 철회)

이용자는 제15조에 의하여 거래가 완료되기 전까지 전자금융거래 시 이용한 해당 전자적 장치를 통하거나 또는 회사가 정하는 절차에 따라 거래지시를 철회 할 수 있습니다.
대량으로 처리하는 거래 또는 예약에 의한 계좌이체 및 추심이체는 이체일 전영업일까지 전자금융거래 시 이용한 해당 전자적 장치를 통하여 거래지시를 철회 할 수 있습니다.
지연이체는 이체지연시간 종료 5분전까지 전자금융거래 시 이용한 해당 전자적 장치를 통하거나 회사가 정한 절차에 따라 거래지시를 철회할 수 있습니다.
실시간 이체되는 거래 등 전자금융거래의 성질상 회사가 거래의 완료 여부를 즉시 확인할 수 없는 경우에는 제1항의 규정에도 불구하고 이용자의 거래지시 철회를 제한할 수 있습니다.
이용자의 요청에 따라 출금계좌를 해지할 때에는 해당 계좌에 등록된 지연이체 및 예약에 의한 계좌이체 거래지시도 철회됩니다.
이용자의 사망·피성년후견선고·피한정후견선고·피특정후견선고(한정치산선고·금치산선고 포함)나 이용자 또는 회사의 해산·합병·파산은 그 자체로는 거래지시를 철회 또는 변경하는 것으로 되지 아니하며 회사의 권한에도 영향을 미치지 아니합니다.
 

제16조(거래내용의 확인)

회사는 제15조의 거래의 처리결과를 이용자가 전자금융거래에 이용한 해당 전자적 장치 또는 컴퓨터 등 대체 전자적 장치를 통하여 즉시 확인할 수 있도록 하여야 합니다. 다만, 다른 계좌로의 이체, 예약에 의한 계좌이체, 지연이체의 경우에는 접수결과를 해당 전자적 장치를 통하여 이용자에게 즉시 알립니다.
제1항의 규정에도 불구하고 이용자가 요청하는 거래내용을 해당 전자적 장치 및 대체 전자적 장치로도 즉시 확인을 해 주는 것이 곤란할 경우 회사는 해당 거래내용을 서면(전자문서를 제외합니다.) 형태로 출력하여 이용자에게 교부하여야 합니다.
이용자는 거래지시와 제1항에 의한 처리결과가 일치하는지 여부를 확인하여야 합니다.


제17조(오류의 정정)

이용자는 전자금융거래에 오류가 있음을 안 때에는 즉시 회사에 정정을 요구할 수 있으며 이 경우 회사는 즉시 조사하여 이체자금의 이동경로를 확인하거나 출금을 제한하는 등 필요한 조치를 취한 후 정정요구를 받은 날부터 2주일 이내에 그 원인과 처리결과를 이용자에게 알려야 합니다.
회사는 스스로 전자금융거래에 오류가 있음을 안 때에는 이를 즉시 조사하여 처리한 후 오류가 있음을 안 날부터 2주일 이내에 그 원인과 처리결과를 이용자에게 알려야 합니다.
 

제18조(사고·장애 시의 처리)

이용자는 거래계좌에 관한 접근매체의 도난, 분실, 위조 또는 변조의 사실을 알았거나 기타 거래절차상 비밀을 요하는 사항이 누설되었음을 알았을 때에는 지체 없이 이를 회사에 신고하여야 합니다.
제1항의 신고는 회사가 이를 접수한 즉시 그 효력이 생깁니다.
제1항의 신고를 철회할 경우에는 이용자 본인이 회사에 서면으로 신청하여야 합니다.
회사는 통신장애 및 기타의 사유로 인하여 거래지시된 전자금융거래가 처리 불가능한 경우에는 출금계좌로 입금처리하고 이용자가 신고한 최종 연락처로 이를 통지하여야 합니다.
회사는 이용자의 요청이 있을 때에는 사고 또는 장애의 사유를 지체 없이 조사하여 그 결과를 이용자에게 통지하여야 합니다.
 

제19조(손해배상 및 면책)

회사는 이용자로부터 접근매체의 분실이나 도난의 통지를 받은 후에 제3자가 그 접근매체를 사용하여 이용자에게 손해가 발생한 경우 그 손해를 배상합니다.
회사는 다음 각 호중 어느 하나의 사고로 인하여 이용자에게 손해가 발생한 경우 그 손해를 배상합니다. 
      가. 접근매체의 위조나 변조로 발생한 사고
      나. 계약체결 또는 거래지시의 전자적 전송이나 처리과정에서 발생한 사고
      다. 전자금융거래를 위한 전자적 장치 또는 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 제2조 제1항 제1호에 따른 회사의 정보통신망에 침입하여 거짓이나 그       밖의 부정한 방법으로 획득한 접근매체의 이용으로 발생한 사고
제1항 및 제2항에 의하여 금전적 손해가 발생한 경우 해당 금액 및 이에 대한 1년 만기 정기예금 이율로 계산한 경과이자를 배상합니다. 다만, 손해액이 해당 금액과 1년 만기 정기예금 이율로 계산한 금액을 초과하는 경우에는 실손해액을 배상합니다.
제2항의 규정에도 불구하고 회사는 이용자가 고의 또는 중과실로 다음 각 호의 행위를 하였음을 증명하는 경우 이용자에게 손해가 생기더라도 책임의 전부 또는 일부를 지지 아니합니다.
      가. 이용자가 접근매체를 제3자에게 대여하거나 사용을 위임한 경우 또는 양도나 담보의 목적으로 제공한 경우(「전자금융거래법」제18조에 따라        선불전자지급수단이나 전자화폐를 양도하거나 담보로 제공한 경우를 제외합니다)
      나. 제3자가 권한 없이 이용자의 접근매체를 이용하여 전자금융거래를 할 수 있음을 알았거나 쉽게 알 수 있었음에도 불구하고 이용자가 자신의 접근매체를 누설       또는 노출하거나 방치한 경우
      다. 회사가 접근매체를 통하여 이용자의 신원, 권한 및 거래지시의 내용 등을 확인하는 것 외에 보안강화를 위하여 전자금융거래 시 사전에 요구하는 추가적인       보안조치를 이용자가 정당한 사유 없이 거부하여 사고가 발생한 경우
     라. 이용자가 제3호에 따른 추가적인 보안조치에 사용되는 매체·수단 또는 정보에 대하여 다음 각 목의 어느 하나에 해당하는 행위를 하여 사고가 발생한 경우
누설·노출 또는 방치한 행위
제3자에게 대여하거나 그 사용을 위임한 행위 또는 양도나 담보의 목적으로 제공한 행위
      마. 법인(「중소기업기본법」제2조 제2항에 의한 소기업을 제외합니다)인 이용자에게 손해가 발생한 경우로 회사가 사고를 방지하기 위하여 보안절차를 수립하고 이를       철저히 준수하는 등 합리적으로 요구되는 충분한 주의의무를 다한 경우
 

제20조(거래기록의 보존)

회사는 전자금융거래와 관련한 다음 각 호의 거래기록(조회거래는 제외합니다)을 5년간 유지, 보존하여야 합니다.
      가. 거래계좌의 명칭 또는 번호
      나. 거래의 종류 및 금액, 거래상대방을 나타내는 정보
      다. 거래일시, 전자적 장치의 종류 및 전자적 장치를 식별할 수 있는 정보 
      라. 회사가 수취한 전자금융 관련 수수료
      마. 추심이체의 경우 지급인의 출금동의 내역 
      바. 전자금융거래 신청, 조건변경에 관한 내용
      사. 해당 전자금융거래와 관련한 전자적 장치의 접속기록
회사는 전자금융거래와 관련한 다음 각 호의 거래기록을 1년간 유지, 보존하여야 합니다. 
      가. 건당 거래금액이 1만원 이하인 소액거래에 관한 기록
      나. 거래승인에 관한 기록
      다. 오류정정 요구 및 처리기록 


제21조(거래기록·자료의 제공)

회사는 이용자의 요청이 있을 경우 「금융실명거래 및 비밀보장에 관한 법률」등 다른 법률에 저촉되지 않는 범위 내에서회사가 보존·관리하고 있는 전자금융거래 관련 기록·자료를 이용자에게 제공하여야 합니다.
이용자가 제공 요청을 할 수 있는 거래기록·자료의 범위와 대상기간은 제21조 제1항 및 제2항에서 정한 기록 및 기간으로 합니다.
이용자가 서면(전자문서를 제외합니다) 형태의 거래기록·자료(이하 “거래명세서”라 합니다)를 제공할 것을 회사에 요청하는 경우에는 본인이 서면으로 영업점에 신청하여야 하며, 회사는 신청 가능 영업점의 주소 및 전화번호 등을 인터넷 등을 통하여 이용자가 알 수 있도록 게시하여야 합니다.
회사는 이용자로부터 제3항에 따른 거래명세서의 제공요청을 받은 경우 2주일 이내에 이용자에게 거래명세서를 교부하여야 합니다.
회사는 불가피한 사유로 인하여 거래기록·자료(거래명세서를 포함합니다)의 제공이 불가능한 경우에는 그 사유를 이용자에게 즉시 통보하여야 하며, 해당 사유가 소멸한 경우 다음 각 호에서 정한 기한 내에 이용자에게 확인 및 제공하여야 합니다.
      가. 전자적 장치를 통한 제공의 경우에는 즉시
      나. 제3항에 따른 서면 제공 방식의 경우에는 2주일 이내에 거래명세서 교부
 

제22조(통지방법 및 효력)

회사는 제18조 제2항, 제19조 제4항 및 제5항 등 전자금융거래에서 발생하는 사항을 통지하는 경우에는 이용자가 신고한 최종 연락처로 전화, 서면 또는 기타 전자적 장치로 통지하여야 하며, 이용자가 서면을 요청하는 경우에는 서면으로 알려야 합니다.
회사의 의사표시는 그 통지가 도달되어야 효력이 생깁니다. 다만, 거래의 처리결과 등 일반적인 사항을 서면으로 통지했을 때에는 보통의 우송기간이 지났을 때 도달된 것으로 추정하며, 이용자가 제24조에 의한 변경신고를 하지 않은 때에는 도달된 것으로 봅니다.
 

제23조(신고사항의 변경 등)

이용자가 계좌번호, 비밀번호, 이용자번호, 상호, 주소, 전화번호 등 회사에 신고한 사항을 변경하고자 하는 경우에는 전자금융거래에 관한 개별약관에 정한 바에 따라 신고하여야 합니다.
신고사항의 변경은 회사가 제1항의 신고를 접수하고 전산입력에 요구되는 합리적인 시간이 지난 후에 그 효력이 생깁니다.
이용자는 제1항에서 정한 신고사항 외의 각종 통지를 회사의 전자금융보조업자에게도 할 수 있습니다. 이 경우 전자금융보조업자에게 한 통지는 회사에게 한 것으로 봅니다.
 

제24조(준수사항)

전자금융거래의 안전한 수행을 위하여 이용자는 회사가 정하는 바에 따라 다음 각 호의 사항을 준수하여야 합니다.
비밀번호 유출 및 해킹 등 전자적 침해를 방지하기 위하여 필요한 조치 및 관리방법
이용자 보호를 위하여 회사가 제공하는 절차와 방법
기타 회사가 정하는 사항
 

제25조(거래내용 녹음)

회사는 거래의 정확성을 기하기 위해 직원과의 전화통화에 의한 거래내용을 녹음할 수 있습니다. 다만, 녹음된 내용은 해당거래에 관한 분쟁이 발생할 경우의 증거자료로만 사용할 수 있으며, 이 경우 이용자는 회사에 녹음된 내용의 청취를 요구할 수 있습니다.
 

제26조(비밀보장의무)

회사는 법령에 정한 경우를 제외하고는 전자금융거래업무를 수행함에 있어서 알게 된 이용자의 인적사항 및 계좌, 접근매체 및 전자금융거래의 내용과 실적에 관한 정보 또는 자료를 이용자의 동의 없이는 다른 사람에게 제공하거나 누설하거나 업무 목적 외 사용을 하여서는 안됩니다.
회사의 관리소홀로 인한 이용자 관련 정보 도난 및 유출 시에는 회사가 책임을 집니다.
 

제27조(약관의 명시·교부·설명)

회사는 이용자에게 약관을 명시하여야 하고, 이용자의 요청이 있는 경우 전자문서의 전송(전자우편을 이용한 전송을 포함합니다), 모사전송, 우편 또는 직접 교부의 방식으로 약관의 사본을 이용자에게 교부하여야 합니다.
회사는 이용자가 약관의 내용에 대한 설명을 요청하는 경우 다음 각 호의 어느 하나의 방법으로 이용자에게 약관의 중요내용을 설명하여야 합니다.
      가. 약관의 중요내용을 이용자에게 직접 설명
      나. 약관의 중요내용에 대한 설명을 전자적 장치를 통하여 이용자가 알기 쉽게 표시하고 이용자로부터 해당 내용을 충분히 인지하였다는 의사표시를 전자적 장치를       통하여 수령
 

제28조(약관의 변경)

회사가 이 약관을 변경하고자 하는 경우에는 변경 1개월 전에 그 내용을 해당 전자금융거래를 수행하는 전자적 장치(해당 전자적 장치에 게시하기 어려울 경우에는 이용자가 접근하기 용이한 전자적 장치) 및 영업점에 게시하고 이용자에게 통지하여야 합니다. 다만, 이용자가 이의를 제기할 경우 회사는 이용자에게 적절한 방법으로 약관 변경내용을 통지하였음을 확인해 주어야 합니다.
제1항에도 불구하고 법령의 개정으로 인하여 긴급하게 약관을 변경한 때에는 변경된 약관을 전자적 장치에 최소 1개월 이상 게시하고 이용자에게 통지하여야 합니다.
회사가 제1항 및 제2항의 게시하거나 통지를 하는 경우에는 “이용자가 약관의 변경 내용이 게시되거나 통지된 후부터 변경되는 약관의 시행일 전의 영업일까지 이내에 계약을 해지할 수 있으며, 약관의 변경 내용에 이의를 제기하지 아니하는 경우 약관의 변경 내용에 승인한 것으로 본다.”라는 취지의 내용을 통지하여야 합니다.
이용자는 약관의 변경 내용이 게시되거나 통지된 후부터 변경되는 약관의 시행일 전의 영업일까지 전자금융거래의 계약을 해지할 수 있고, 약관의 변경내용에 대하여 이의를 제기하지 아니하는 경우에는 약관의 변경을 승인한 것으로 봅니다
 

제29조(약관적용의 우선순위)

회사와 이용자 사이에 개별적으로 합의한 사항이 이 약관에 정한 사항과 다를 때에는 그 합의사항을 이 약관에 우선하여 적용합니다.
전자금융거래에 관하여 이 약관에 정하지 않은 사항은 개별약관이 정하는 바에 따릅니다.
이 약관과 전자금융거래에 관한 개별약관에 정하지 않은 사항에 대하여는 다른 약정이 없으면「전자금융거래법」등 관계 법령, 예금거래기본약관 및 은행여신거래기본약관(가계/기업용)을 적용합니다.
 

제30조(이의제기 및 협조)

이용자는 전자금융거래의 처리에 관하여 이의가 있을 때에는 회사의 분쟁처리기구에 그 해결을 요구하거나 금융감독원 금융분쟁조정위원회, 한국소비자원 소비자분쟁조정위원회 등을 통하여 분쟁조정을 신청할 수 있습니다.
이용자가 회사의 본점이나 영업점 또는 회사의 분쟁처리기구에 이의를 제기한 경우 회사는 15일 이내에 이에 대한 조사 또는 처리결과를 이용자에게 알려야 합니다.
회사는 손해배상 등 분쟁처리를 위한 분쟁처리책임자 및 담당자를 지정하고, 그 연락처를 관련 인터넷 홈페이지에 게시하여야 합니다.
이용자는 제20조 제2항에 정한 사고발생으로 인한 손해배상 등 분쟁처리와 관련한 회사의 사고조사 및 관계당국의 수사 또는 조사 절차에 협조하여야 합니다.
 

제31조(착오송금에 대한 협조의무)

이용자가 송금금액, 수취은행, 수취인 계좌번호 등을 잘못 입력하여 송금(이하 ‘착오송금’이라 합니다)하였음을 회사에게 통지하는 경우 회사는 다음과 같은 조치를 하여야 합니다.
송금은행과 수취은행이 동일한 경우 즉시 수취인에게 착오송금 사실, 반환의무 등을 알리고, 수취인에대한 연락 사실, 수취인의 반환의사 유무, 수취인이 반환의사가 없는 경우 그 사유 등을 송금인에게 알려야 합니다.
송금은행과 수취은행이 다른 경우 수취은행에게 즉시 착오송금임을 알리고, 수취은행으로부터 전달받은 사항(수취인에 대한 연락 사실, 수취인의 반환의사 유무, 수취인이 반환의사가 없는 경우 그 사유 등)을 송금인에게 알려야 합니다.
 

제32조(준거법)

이 약관의 해석·적용에 관하여는 대한민국법을 적용합니다. 


부 칙

제1조(시행령)

본 약관은 2025.12.14.부터 적용합니다.
  `;

  return (
    <TermsModal isOpen={isOpen} title="전자금융거래 이용약관 동의" onClose={onClose}>
      <pre className="termsModalText">{TERMS_CONTENT}</pre>
    </TermsModal>
  );
}
