// 판매자 인증 및 가입 페이지 약관 1
import TermsModal from "./TermsModal";

export default function Terms3Modal({
  isOpen,
  onClose,
}: {
  isOpen: boolean;
  onClose: () => void;
}) {
  const TERMS_CONTENT = `
 판매자 이용약관



제1조(목적)

본 약관은 같이시켜가 운영하는 인터넷 사이트 ''(이하 '사이트'라 합니다)및 이를 통해 제공되는 전자상거래 서비스와 관련하여 당사자의 권리 의무 및 책임사항을 규정하는 것을 목적으로 합니다.
PC통신, 무선 등을 이용하는 전자상거래에 대하여도 그 성질에 반하지 않는 한 본 약관을 준용합니다.
 

제2조(정의)

본 약관에서 사용하는 용어의 정의는 다음과 같습니다.
'회사'라 함은, ’같이시켜’에 재화 또는 용역(이하 '상품'이라 합니다)을 제공하기 위하여 컴퓨터 등 정보통신설비를 이용하여 상품을 거래할 수 있도록 설정한 가상의 영업장을 운영하는 주체를 말하며, 아울러 '같이시켜'을 통해 제공되는 전자상거래 관련 서비스의 의미로도 사용합니다.
'오픈마켓'이라 함은, '회사'가 '사이트'를 통하여 '이용자'간 상품 거래가 이루어질 수 있는 사이버 거래장소를 온라인으로 제공하는 서비스 및 관련 부가 서비스 일체를 말합니다.
‘모바일앱'이라 함은, '회사'가 개발 및 운영을 담당하고, '이용자'의 편의를 위하여 제공하는 모바일 애플리케이션을 말합니다.
'이용자'라 함은, '사이트'에 접속하여 '회사'의 이용약관에 따라 '회사'가 제공하는 서비스를 받은 '회원' 및 '비회원'을 말합니다.
'회원'이라 함은 '회사'에 개인정보를 제공하여 회원등록을 한 자로서, '회사'로부터 서비스 제공에 관한 정보를 지속적으로 제공 받으며, '회사'가 제공하는 서비스를 계속적으로 이용할 수 있는자를 말합니다.
'판매자'라 함은, 본 약관에 동의하고 '회사'와 서비스 이용계약을 체결한 자를 말하며, 와 같은 상품을 판매할 의사로 '회사'가 제공하는 양식에 맞추어 등록한 이용자의 의미로도 사용합니다.
'구매자'라 함은, 상품을 구입할 의사를 '회사'가 제공하는 양식에 맞추어 전달한 이용자를 말합니다.
'상품'이라 함은, '판매자'가 '오픈마켓'을 통하여 판매하는 재화 및 용역 등 일체의 서비스를 말합니다.
본 조에서 정의되지 않은 본 약관 상의 용어는 일반적인 거래관행에 따라 해석합니다.


제3조(약관 외 준칙)

본 약관에서 정하지 아니한 사항은 법령 또는 '회사'가 정한 서비스의 개별 약관, 운영정책 및 규칙(이하 '세부지침'이라 합니다)의 규정에 다릅니다. 또한 본 약관과 세부지침이 충돌할 경우에는 세부지침이 우선합니다.
 

제4조(약관의 명시 및 개정)

'회사'는 이 약관의 내용과 상호 및 대표자 성명, 영업소 소재지, 전화번호, 모사전송번호(FAX), 전자우편주소, 사업자등록번호, 통신판매업신고번호 등을 '이용자'가 쉽게 알 수 있도록 '사이트'의 초기 서비스화면에 게시합니다. 다만, 본 약관의 내용은 '이용자'가 연결화면을 통하여 확인할 수 있도록 할 수 있습니다.
'회사'는 '이용자'가 약관에 동의하기에 앞서 약관에 정해진 내용 중 청약철회, 배송책임, 환불조건 등과 같은 내용을 '이용자'가 이해할 수 있도록 별도의 연결화면 또는 팝업화면 등을 통하여 '이용자'의 확인을 구합니다.
'회사'는 ‘전자상거래 등에서의 소비자보호에 관한 법률(이하 '전자상거래법'이라 함)', '약관의 규제에 관한 법률(이하 '약관규제법'이라 함)', '전자문서 및 전자거래 기본법(이하 '전자문서법'이라 함)', ‘전자금융거래법 ‘, '정보통신망 이용촉진 및 정보보호 등에 관한 법률(이하 '정보통신망법'이라 함)', '소비자기본법' 등 관계 법령(이하 '관계법령' 이라 함)에 위배되지 않는 범위 내에서 본 약관을 개정할 수 있습니다.
'회사'가 본 약관을 개정하고자 할 경우, 적용일자 및 개정사유를 명시하여 현행약관과 함께 온라인 쇼핑몰의 초기화면에 그 적용일자 7일전부터 적용일자 전날까지 공지합니다. 다만, '이용자'에게 불리한 내용으로 약관을 변경하는 경우 최소 30일 이상 유예기간을 두고 공지합니다.
'회사'가 본 약관을 개정한 경우, 개정약관은 적용일자 이후 체결되는 계약에만 적용되며 적용일자 이전 체결된 계약은 개정 전 약관이 적용됩니다. 다만, 이미 계약을 체결한 '이용자'가 개정약관의 내용을 적용받고자 하는 뜻을 '회사'에게 전달하고, '회사'가 여기에 동의한 경우 개정약관을 적용합니다.
 

제5조(서비스의 제공 및 변경)

'회사'가 제공하는 서비스는 연중무휴, 1일 24시간 제공을 원칙으로 합니다. 다만, '쇼핑몰' 시스템의 유지 보수를 위한 점검, 통신장비의 교체 등 특별한 사유가 있는 경우 서비스의 전부 또는 일부에 대하여 일시적인 제공 중단이 발생할 수 있습니다.
'회사'는 전시, 사변, 천재지변 또는 이에 준하는 국가비상사태가 발생하거나 발생할 우려가 있는 경우, 전기통신사업법에 의한 기간통신사업자가 전기통신서비스를 중지하는 등 부득이한 사유가 발생한 경우 서비스의 전부 또는 일부를 제한하거나 중지할 수 있습니다.
'회사'가 서비스를 정지하거나 이용을 제한하는 경우 그 사유 및 기간, 복구 예정 일시 등을 지체 없이 '이용자'에게 알립니다.


제6조(회원가입 및 승낙)

회원가입은 '회원'이 되고자 하는 '이용자'가 약관의 내용에 동의를 하고, 회사가 정한 가입 양식에 따라 회원정보(이용자ID, 비밀번호, 주소, 연락처 등)를 기입하여 회원가입 신청을 하고 회사가 이러한 신청에 대하여 승인함으로써 체결됩니다.
'이용자'의 회원가입신청에 대하여 '회사'가 승낙한 경우, '회사'는 이용자 ID 및 비밀번호 기타 '회사'가 필요하다고 인정하는 내용을 '이용자'에게 통지합니다.
'회사'는 '이용자'의 신청에 대해서 회원가입을 승낙하는 것을 원칙으로 합니다. 다만, 다음 각 호에 해당하는 경우에 대하여는 승인을 하지 아니할 수 있습니다.
      가. 본인의 정보가 아닌, 타인의 정보를 도용하여 신청한 경우 
      나. 신청서의 내용을 허위로 기재한 경우
      다. 관계법령 또는 공서양속에 반하는 신청의 경우
      라. 부정한 목적으로 본 서비스를 이용하고자 하는 경우
      마. 기타 '회원'으로 등록하는 것이 적절하지 않은 것으로 판단되는 경우
 

제7조(제공하는 서비스)

회사가 제공하는 서비스는 다음과 같습니다.
전자상거래 플랫폼 개발 및 운영서비스
판매관련 지원서비스
구매관련 지원서비스
매매계약체결 관련 서비스
상품 정보검색 서비스
광고 및 프로모션 서비스
기타 '회사'가 정하는 서비스
 

제8조(판매서비스 이용계약)

판매 서비스 이용계약(이하 '이용계약'이라고 합니다)은 회사가 제공하는 판매 서비스를 이용하고자 하는 자의 이용신청을 '회사'가 승낙함으로써 성립합니다. 이때 이용 승낙의 의사표시는 해당 서비스 화면 또는 가입 신청 시 기재한 e-mail 등의 방법으로 통지할 수 있습니다.
'이용계약'을 체결하고자 하는 자는 본 약관의 내용에 대한 동의를 표시하고, '회사'가 정하는 회원 가입 신청 양시에 따라 신청서를 작성하여 제출합니다.
'이용계약'은 만 14세 이상의 개인 또는 법인사업자가 신청할 수 있습니다.
'이용계약'의 체결시기는 제1항에 따라 '회사'의 승낙이 '회원'에게 도달한 시점으로 합니다.
'회사'는 본 약관 '회원가입 및 승낙'에서 정한 가입 거부 사유가 있는 경우 '이용계약'을 체결하지 않을 수 있습니다.
 

제9조(판매서비스의 이용계약의 해지)

'판매자'는 언제든지 '회사'에게 해지의사를 통지함으로써 이용계약을 해지할 수 있습니다. 다만, '판매자'는 해지의사를 통지하기 전에 모든 상품의 판매 절차를 완료, 철회 또는 취소해야만 하며 판매의 철회 또는 취소로 인한 불이익은 '판매자' 본인이 부담하여야 합니다.
'이용계약'은 '판매자'의 해지의사가 '회사'에 도달한 때에 종료됩니다.
본 조에 따라 해지를 한 판매자는 이 약관이 정하는 판매자 가입절차와 관련조항에 따라 판매자로 다시 가입할 수 있습니다.
본 계약의 해지통보에도 불구하고 계약해지 시점까지 발송되지 아니한 주문상품, 교환 또는 환불 요청이 접수된 경우 '판매자'는 상품의 배송, 교환 및 환불에 필요한 협력을 다하여야 할 의무가 있으며 본 의무는 정산완료가 확인되거나 구매자에 대한 조치가 완료되면 종료합니다.
 

제10조('회사'의 '이용계약'의 해지 및 '판매자' 자격상실)

'회사'는 다음 각 호의 사유가 발생한 경우 별도의 최고 없이 '판매자'에게 계약 해지의 통지를 함으로써 본 계약을 해지할 수 있습니다.
      가. 허위 또는 과장된 상품정보를 게재한 경우
      나. 관계 법령에 위반하는 등 매매 부적합 물품을 등록 또는 판매한 경우
      다. '판매자'가 비밀을 누설하거나 본 약관에 위반하여 고객정보를 이용한 경우
      라. '판매자'가 본 약관의 의무를 위반하여 '회사'가 고객으로 부터 중대한 클레임이 접수된 경우 
      마. '판매자'가 본 약관의 의무를 위반하여 '회사'가 그 개선을 요청하였으나, 정당한 사유없이 이를 이행하지 아니한 경우
      바. '판매자'가 본 약관에 정한 의무를 누적 3회 위반한 경우
      사. '판매자'가 '구매자'와 직접 대금을 주고 받는 등 직거래 유도행위를 한 경우
      아. '회사'의 시스템 및 서비스를 악용하여 스팸정보전송, 악성프로그램 유포 등 법령에서 금지하는 행위를 한 경우
본 약관의 당사자 중 일방에게 다음 각 호의 사유가 발생한 경우 그 상대방은 별도의 최고 없이 계약 해지 의사를 통지하여 본 계약을 해지할 수 있습니다.
      가. 본 약관의 의무를 위반하여 상대방 당사자로부터 시정을 요구 받은 후 7일이 경과할 때 까지 특별한 사유나 해명 없이 이를 시정하지 아니한 경우
      나. 감독기관에 의하여 영업 또는 허가의 취소 또는 정지 등 처분을 받은 경우 
      다. 파산, 화의 또는 회사정리 절차의 신청이 있거나 스스로 이를 신청한 경우
      라. 발행한 어음 또는 수표가 부도로 되거나 은행과의 거래가 정지 또는 금지된 경우 
      마. 현저하게 상대방의 명예를 훼손한 경우
      바. 기타 계약기간 내 계약의 이행이 불가능 하거나, 계약 목적을 달성할 수 없게 할 만한 중대한 사유가 발생한 경우
본 약관에 따라 '이용계약'이 해지된 경우 그 해지된 날 기준으로 본 약관에서 정하는 절차에 따라 판매대금을 정산합니다.
본 약관에 따라 '이용계약'이 해지된 경우에도 해지 시까지 발송되지 아니한 주문된 상품 또는 교환 또는 환불 요청을 받은 상품이 있는 경우 판매자는 상품의 배송, 교환 및 환불에 필요한 협력을 다하여야 할 의무가 있으며 본 의무는 판매대금의 정산이 완료되거나 '구매자'에 대한 모든 조치가 완료된 것이 확인된 경우 종료합니다.
'이용계약'의 종료와 관련하여 발생한 손해는 해당 '판매자'가 책임을 부담하여야 합니다.
 

제11조(회원에 대한 통지)

'회사'가 '회원'에 대한 통지를 하는 경우, 가입 시 기입한 전자우편 주소로 할 수 있습니다.
'회사'가 불특정 다수 '회원'에 대하여 통지를 하는 경우, 1주일 이상 '사이트'의 게시판 또는 연결화면을 통해 공지할 수 있습니다.
'회사'가 '판매자'에게 통지를 하는 경우, 판매자 전용화면(이하 '전용화면'이라 합니다)을 통하여 개별 통지를 갈음할 수 있습니다.
 

제12조(판매자의 통지의무)

'판매자'는 다음 각 호의 사유가 발생한 경우에는 지체 없이 그 내용을 '전용화면'을 통해 변경하여야 하며 사업자등록증 등 관련문서를 '회사'에 서면으로 제출하여야 합니다.
      가. 주소, 상호, 대표자 등 사업자 등록증에 명시된 사항이 변경된 경우 
      나. 통장계좌 등의 변경이 있는 경우
      다. 자본구성에 중대한 변경이 있는 경우
      라. 개인사업자가 법인으로 또는 법인이 개인사업자로 변경된 경우 
      마. 기타 연락전화 및 휴대전화, 전자우편주소 등의 변경이 있는 경우
본 조의 의무를 게을리 하거나 누락하여 발생한 모든 문제는 '판매자'가 책임을 부담합니다.


제13조(전자상거래 플랫폼 서비스)

'회사'는 '오픈마켓'을 통해 '사이트'에서 '판매자'가 상품을 판매할 수 있도록 지원합니다.
'회사'는 판매촉진을 위하여 국내외 포털 사이트, 가격비교 사이트, 제휴사가 운영하는 사이트 등에 광고를 게재할 수 있으며, 당사자와 협의하여 할인행사 등의 이벤트를 실시 할 수 있습니다.
'회사'는 판매자가 등록한 상품 정보를 사전에 정한 기준과 방법에 따라 '사이트' 및 '모바일앱'에 게재합니다. 이 때 '회사'는 게재하는 상품정보의 위치, 크기, 배열 등을 결정하고 조정할 수 있으며, 필요한 경우 상품정보 외의 사항을 함께 게재할 수 있습니다.
'회사'는 등록된 상품정보에 근거하여 가격비교 방식으로 제공할 수 있습니다.
 

제14조(판매자의 의무)

'판매자'는 이 약관과 '회사'의 서비스화면을 통하여 미리 공지하는 개별약관이 정하는 절차에 따라 상품의 등록, 판매진행과정의 관리, 구매자에 대한 거래이행, 물품배송, 청약철회 또는 반품 등 사후처리를 수행하여야 합니다.
'판매자'는 '사이트' 내의 상품페이지의 전용 게시판 등을 통해 접수된 상품 관련 문의에 대하여 성실하게 응하여야 하며, 적절한 답신을 작성하고 게재해야 합니다.
'판매자'는 '구매자'의 구매취소 요청이 있는 경우 이에 응하여야 하며, 취소에 필요한 절차를 자신의 책임과 비용으로 이행하여야 합니다.
'판매자'는 물품등록시 '구매자'와 직거래를 유도하는 문구를 기재하는 내용, 구매자의 정당한 권리를 제한하는 내용, 및 기타 위법한 문구 또는 사진을 등록하여서는 안 됩니다. 이를 위반한 경우 '회사'는 관련 '판매자' 및 상품에 대하여 등록 취소 및 삭제 기타 필요한 조치를 취할 수 있습니다.
'판매자'는 판매 중이거나 판매를 개시할 상품의 재고를 충분히 확보하여야 하며 재고가 소진되어 정상적인 상품 판매에 차질이 예상되는 경우 지체없이 상품의 판매를 중단해야 합니다. 만약 이미 주문된 상품이 재고부족으로 배송이 불가능할 경우, '판매자'는 즉시 해당 상품의 판매를 중지하고 '회사'와 '구매자'에게 이를 통보하여야 합니다.
'판매자'는 '회사'의 명칭, 로고 및 '판매자'의 신용등급 표시를 '회사'의 동의 없이 임의로 사용하거나 지정된 곳 이외의 장소에 표시하여서는 안되며, 이러한 행위로 인하여 '회사', '이용자' 및 다른 '판매자'에게 손해가 발생한 경우 이와 상당한 인과관계 있는 모든 손해를 배상해야합니다.
'판매자'는 '사이트'에서의 상거래와 관련하여 관계법령에서 정하고 있는 자료를 보관하여야 합니다.
'판매자'는 상품을 판매하기 위하여 특정한 인·허가 등의 자격이 필요한 경우 이에 대한 요건을 흠결없이 갖추고 유지하여야 합니다.
 

제15조(등록된 상품정보의 취소 및 삭제)

'판매자'는 '전용화면'을 통해 상품 정보를 등록해야 합니다. 다만 '회사'는 다음 각호의 사유가 있는 경우 그 등록을 취소하거나 삭제할 수 있습니다.
상품등록양식에 어긋난 등록, 허위 및 중복 등록, 판매를 가장한 등록
중요 판매정보에 오기 또는 모순이 있는 등록
과다한 허위출고 또는 명백한 허위출고의 반복
'판매자' 정보에 입력된 연락수단을 통하여 연락을 취하였으나 연락이 두절된 경우
'판매자'의 고객문의 처리율 및 만족도가 저조하고 개선되지 않는 경우
상품 카테고리 오등록 또는 동일한 카테고리 및 유사 카테고리에 상품을 중복으로 등록하는 경우
기타 '회사'의 상품관련 서비스 비용이 과다하게 발생하는 경우
 

제16조(상품의 등록 및 관리)

'판매자'는 판매하고자 하는 물품의 명칭, 가격, 특성 등 상품에 관한 정보와 판매가격, 재고, 배송 등 판매와 관련된 정보를 '전용화면'에서 직접 등록하여야 하며, 그 내용이 사실과 부합하도록 상시 관리하여야 합니다.
'판매자'는 상품의 명칭, 사양, 원산지, 제조사, 제조일자, 성분, 용량 등 상품의 가치에 영향을 미치는 정보에 대하여 그 진실성을 보장하여야 합니다. 이에 반하는 허위사실이 있을 경우 또는 허위광고의 게시 및 방조의 경우 모든 책임은 '판매자'가 부담합니다.
 

제17조(상품의 판매가격 및 이용료)

상품의 판매가격은 '판매자'가 결정합니다. 다만 할인쿠폰이나 이벤트 등 가격을 할인하는 경우 판매가격은 차감된 금액을 기준으로 합니다.
상품의 판매와 관련된 제반 비용(이하 '서비스 이용료'라 합니다)는 '회사'가 결정하며, '판매자'가 '전용화면'에서 상품을 등록할 경우 이를 알 수 있게 적절히 표시합니다.
'회사'가 부과하는 '서비스 이용료'는 상품등록 이용료, 기타 이용료로 구분됩니다. 각 서비스 및 서비스 이용료의 구체적인 내용은 해당 서비스화면에 별도로 게재합니다.
      가. 상품등록 이용료
상품등록이용료는 판매가와 등록 상품수 및 등록기간을 기준으로 책정되며, 상품 등록시에 부과됩니다.
상품등록이용료는 판매성사 여부, 반품 여부에 관계없이 환불되지 않습니다. 다만 '회사'의 '이용계약'해지에 따른 판매취소, '회사' 서비스 상의 하자로 인하여 상품등록이 정상적으로 이루어지지 않거나 판매가 취소되는 경우에는 상품등록이용료를 환불합니다.
'회사'는 필요한 경우 서비스이용료를 신설하거나 변경할 수 있으며, 그 내용은 '전용화면'을 통하여 통지합니다.
'회사'는 '판매자'와 협의하여 할인쿠폰을 발행하고, 적용할 수 있고 '구매자'가 이를 사용하는 경우(단, '판매자'가 '회사'와 협의하지 않고 임의로 판매금액을 할인하는 경우는 제외합니다) 판매이용료는 할인쿠폰 금액을 차감한 금액을 기준으로 부과합니다.
 

제18조(판매부적합 상품)

다음 각 호의 물품은 판매부적합 상품으로서 상품의 등록 및 판매를 금합니다. 아래 항목은 예시규정으로서 '회사'는 관계법령 또는 일반 거래관행, 사회통념에 따라 개별적으로 판매부적합 상품 여부를 판단하여 제재할 수 있습니다.
      가. 허위 또는 과장 광고한 상품
      나. 제3자의 지식재산권을 침해하는 상품
      다. 법률상 통신판매가 금지된 의약품, 주류, 담배 등의 상품 
      라. 법률상 필요한 신고, 허가, 등록 등 절차를 거치지 않은 상품 
      마. 정당한 소유권이 없는 장물 또는 습득물
      바. 공공질서 및 선량한 사회풍속에 위배되는 상품 
      사. 판매 이외의 목적이 의심되는 상품
      아. '구매자'의 정당한 철회권을 임의로 제한, 거부할 것이 명시된 상품
      자. 기타 '회사'의 명예, 신용 기타 사회적 평가를 실추시킬 우려가 있다고 판단되는 상품
'판매자'의 고의 또는 과실로 판매부적합 상품이 등록된 경우, '회사'는 즉시 해당 상품의 판매를 중지시키고 이 사실을 '판매자'에게 통보합니다. 만약, '판매자'의 고의에 의한 등록으로 판단될 경우 '회사'는 '이용계약'을 해지할 수 있습니다.
'판매자'의 고의 또는 과실로 판매부적합 상품이 판매된 경우, '회사'는 즉시 해당 상품의 판매를 중지하고 즉시 '이용계약'을 해지합니다. 이 때 '회사'는 필요한 경우 관계 기관에 위 사실을 즉시 신고할 수 있습니다.
판매부적합 상품을 등록한 경우 그 등록에 사용된 이용료 등 제반 비용은 환불되지 않습니다.
'판매자'는 매매 부적합 물품의 등록 및 판매에 대한 모든 법적인 책임을 부담합니다
 

제19조(판매자의 수신확인통지)

'판매자'는 '구매자'가 상품 등에 대하여 구매신청을 한 경우 그 내용을 '구매자'에게 확인하는 내용의 수신확인통지를 하여야 합니다.
수신확인통지를 받은 '구매자'는 의사표시의 불일치가 있는 경우 통지를 받은 후 즉시 구매신청 내용의 변경 또는 취소를 요청할 수 있고, '판매자'는 배송 준비 전 '구매자'의 요청이 있는 경우 지체없이 그 요청에 따라 변경 또는 취소처리 하여야 합니다. 다만 '구매자'가 이미 대금을 지불한 경우 본 약관의 '청약철회 등'에서 정한 바에 따릅니다.
 

제20조(상품의 배송)

'판매자'는 별도의 약정이 없는 이상, '구매자'가 청약을 한 날부터 7일 이내에 상품을 배송할 수 있도록 주문제작, 포장 등 기타 필요한 조치를 취해야 합니다. 다만, 구매자가 이미 대금의 전부 또는 일부를 지급한 경우에는 그 대금을 받은 날부터 3 영업일 이내에 필요한 조치를 취해야 합니다.
'판매자'는 '구매자'가 상품의 공급 절차 및 진행 상황을 확인할 수 있도록 적절한 조치를 취해야 하며, '회사'는 이에 협력하여야 합니다.
'판매자'는 '구매자'가 청약한 상품이 품절, 생산중단 등의 사유로 인도 또는 제공할 수 없게된 경우 지체업이 그 사유를 '구매자'와 '회사'에 통지하여야 합니다. 이때 '구매자'가 상품의 대금을 지불한 경우 대금을 받은 날부터 3 영업일 이내에 환급 또는 필요한 조치를 취해야 합니다.
'판매자'는 회사가 지정하는 물류대행업체를 통해 상품을 배송할 수 있습니다. 이 때 물류대행업체의 이용절차 및 배송위치 확인 서비스의 세부사항은 개별약관이나 약정에 따릅니다.
'판매자'가 상품을 발송한 경우, 즉시 발송일자, 택배 운송장번호, 등기화물번호 등 적절한 코드를 '전용화면'에 입력함으로써 이 사실을 '회사'가 확인할 수 있도록 해야 합니다.
거래된 상품의 운송과 관련하여 '판매자'와 '구매자', 물류대행업체, 금융기관 등 관련 당사자 사이에 분쟁이 발생한 경우, '회사'는 이에 관여하지 않으며 어떠한 책임도 부담하지 않습니다.
 

제21조(청약철회 등)

'판매자'와 재화 등의 구매에 관한 계약을 체결한 '구매자'는 본 약관에 따른 수신확인의 통지를 받은 날 부터 7일 이내에 청약을 철회할 수 있습니다.
전항의 규정에도 불구하고 다음 각 호의 사유에 해당하는 경우, 배송받은 재화의 반품 또는 교환이 제한됩니다.
      가. '구매자'에게 책임있는 사유로 상품이 멸실 또는 훼손된 경우(다만, 재화를 확인하기 위하여 포장 등을 훼손한 경우는 예외로 합니다)
      나. '구매자'의 사용 또는 소비에 의하여 재화의 가치가 현저히 감소한 경우 
      다. 시간의 경과로 재판매가 곤란할 정도로 재화의 가치가 현저히 감소한 경우
      라. 같은 성능을 지닌 재화 등으로 복제가 가능한 경우 그 원본이 되는 재화의 포장을 훼손한 경우 마. '구매자'의 주문에 의하여 개별적으로 생산한 제품으로서       청약철회 및 교환의 제한에 대하여 사전에 고지한 경우
'판매자' 또는 '회사'가 전 항의 청약철회 제한 사유를 '구매자'가 알기 쉽게 명시하거나, 시용상품을 제공하는 등의 조치를 취하지 않은 경우 '구매자'의 청약철회가 제한되지 않습니다.
본 조의 규정에도 불구하고, '구매자'는 상품 등의 내용이 표시, 광고 내용과 다르거나 계약내용과 다르게 이행된 때에는 당해 상품을 공급받은 날로부터 3월 이내, 그 사실을 안날 또는 알 수 있었던 날로부터 30일 이내에 청약철회 등을 할 수 있습니다.
 

제22조(판매대금의 정산 및 지급)

'구매자'가 상품을 수령한 후 구매의사를 확정하면, 지체없이 '구매자 전용화면'에서 구매확정 의사를 표시(이하 '구매확정'이라 합니다)하여야 합니다. 다만, 수령 후 7일 이내에 '구매확정'하지 않는 경우 '회사'는 그 익일부터 '구매확정'으로 처리할 수 있습니다.
'구매확정'으로 처리되면 '회사'는 즉시 '판매자'에게 대금을 지급하며, 이 후 발생하는 환불, 교환, 수리 등의 절차는 구매자'와 '판매자'가 직접 해결하여야 합니다.
'판매자'의 출금 요청이 있을 경우, '회사'는 접수일 기준 2 영업일 내에 등록된 계좌로 대금을 송금합니다.
'회사'는 당월 구매확정 된 상품의 판매대금에 대하여 수수료 및 세금계산서를 익월 10일까지 일괄 발행합니다.
'회사'는 '판매자'에게 상품의 거래내역, 서비스 이용료 부과 내역, 세금계산서 발행 신청 내역 등을 '전용화면'을 통하여 제공합니다.
 

제23조(대금의 정산 유보)

'회사'는 '판매자'의 귀책사유로 발생한 비용을 대금 정산 시 공제할 수 있으며, '이용계약'이 종료된 날로부터 '판매자'가 판매한 상품과 관련된 절차를 완료하였음이 확인될 때까지 판매대금의 정산을 유보할 수 있습니다.
'회사'는 장기간 배송이 지연된 구매건에 대하여 향후 '구매자'의 환불, 청약철회에 대비하여 판매대금의 정산을 유보할 수 있습니다.
'회사'는 '판매자'가 법원의 결정에 따라 판매대금의 가입류, 압류 및 추심명령 등을 받은 경우, 동 결정이 해제될 때까지 판매대금의 정산을 유보할 수 있습니다.
'회사'는 법률의 규정 또는 '판매자'의 본 약관 위반 등 합리적인 사유가 있는 경우 '전용화면'을 통하여 통지하고 판매대금의 전부 또는 일부에 대한 정산을 유보할 수 있습니다.
 

제24조(비밀유지)

본 약관의 당사자는 관계법령에 특별한 규정이 있는 경우를 제외하고는 취득한 개인정보, 기술정보, 생산 및 판매계획 등 비밀로 관리되는 정보를 제3자에게 누설하여서는 아니 되며, 그 정보를 본 약관 이외의 목적으로 사용하여서는 안 됩니다.
'판매자'는 판매를 통해 얻은 고객에 대한 정보를 이용하여, '회사'를 통하지 않고 고객에게 접촉하거나 직거래를 유도 하는 등의 행위를 하여서는 안 됩니다.
'판매자'는 자신의 ID와 비밀번호의 보안을 유지하여야 하며, 이를 제3자가 이용하게 하여서는 안 됩니다.
본 조의 비밀유지 의무는 본 약관에 의한 계약관계가 종료된 이후에도 3년간 존속합니다.
 

제25조(면책규정)

'회사'가 '판매자'와 '구매자'에게 제공하는 서비스는 '사이트'를 통한 온라인 거래장소(Marketplace) 및 기타 부가 정보를 제공하는데 불과하므로, '사이트'를 통하여 이루어지는 '판매자'와 '구매자' 상호간의 거래에 대하여 '회사'는 관여하지 않으며 어떠한 책임도 부담하지 않습니다.
'회사'는 '이용자'의 귀책사유로 인한 서비스 이용 장애에 대하여 책임을 부담하지 않습니다.
'회사'는 '사이트'를 통하여 거래되는 상품의 하자, 상품정보 상의 오류, 미비 등으로 인하여 '구매자'에게 발생한 손해에 대한 책임(제조물책임 포함)을 부담하지 않습니다.
'회사'는 '이용자'가 '다른 이용자'가 게재한 정보, 자료, 사실의 정확성을 신뢰함으로써 입은 손해에 대하여 책임을 부담하지 않습니다.
'회사'가 제공한 링크로 연결된 제휴사이트(이하 '제휴사이트'라 합니다)는 '회사'와 독자적으로 운영되며, '회사'는 '제휴사이트'와 '이용자'사이에 이루어진 거래에 대하여 책임을 부담하지 않습니다.
 

제26조(분쟁의 해결)

'회사'는 '이용자'가 제기하는 불만사항 및 의견을 지체없이 처리하기 위하여 노력합니다. 다만, 신속한 처리가 곤란한 경우 '이용자'에게 그 사유와 처리일정을 즉시 통보합니다.
'회사'와 '이용자'간 발생한 분쟁에 관한 소송은 '회사' 소재지를 관할 하는 법원을 제1심 관할 법원으로 하며, 준거법은 대한민국의 법령을 적용합니다.


부 칙 

제1조(시행일)

본 약관은 2025.12.14. 부터 적용합니다.
  `;

  return (
    <TermsModal isOpen={isOpen} title="판매자 이용약관 동의" onClose={onClose}>
      <pre className="termsModalText">{TERMS_CONTENT}</pre>
    </TermsModal>
  );
}
